china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f7/src/cpu_peri_lcd.c
    DMA2D->CR&=~(1<<0);
    DMA2D->CR=3<<16;
    DMA2D->OPFCCR=lcd.Dma2dPixelFormat;
    DMA2D->OOR  = lcd_display.width-width;
    DMA2D->OMAR =  addr;
    DMA2D->NLR  = height|(width<<16);
    DMA2D->OCOLR=color;
    DMA2D->CR|=1<<0;
    while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
    {
        timeout++;
        if(timeout>0X1FFFFF)
            {
                break;  //超时退出
                flag=false;
            }
    }
    DMA2D->IFCR|=1<<1;              //清除传输完成标志
    Lock_MutexPost(&Dma2dMutex);
    return flag;
}

//------------------------------------------------------------------
//功能: LTDC 初始化
//参数: true/false
//返回:
//-----------------------------------------------------------------------------
static void LTDC_Init(u8 *pFrameBufferFG)
{
    LTDC_Clk_Set(lcd.LtdcClk*4,2,RCC_PLLSAIDIVR_2);//设置像素时钟  50Mhz
    LTDC_Handler.Instance=LTDC;
    LTDC_Handler.Init.HSPolarity=lcd.LtdcHSPolarity;     //水平同步极性
    LTDC_Handler.Init.VSPolarity=lcd.LtdcVSPolarity;     //垂直同步极性
    LTDC_Handler.Init.DEPolarity= lcd.LtdcDEPolarity;    //数据使能极性
    LTDC_Handler.Init.PCPolarity=lcd.LtdcPCPolarity;     //像素时钟极性
    LTDC_Handler.Init.HorizontalSync=lcd.hsw-1;          //水平同步宽度
    LTDC_Handler.Init.VerticalSync=lcd.vsw-1;            //垂直同步宽度
    LTDC_Handler.Init.AccumulatedHBP=lcd.hsw+lcd.hbp-1;  //水平同步后沿宽度
    LTDC_Handler.Init.AccumulatedVBP=lcd.vsw+lcd.vbp-1;  //垂直同步后沿高度
    LTDC_Handler.Init.AccumulatedActiveW=lcd.hsw+lcd.hbp+lcd_display.width-1;//有效宽度
    LTDC_Handler.Init.AccumulatedActiveH=lcd.vsw+lcd.vbp+lcd_display.height-1;//有效高度
    LTDC_Handler.Init.TotalWidth=lcd.hsw+lcd.hbp+lcd_display.width+lcd.hfp-1;//总宽度
    LTDC_Handler.Init.TotalHeigh=lcd.vsw+lcd.vbp+lcd_display.height+lcd.vfp-1;//总高度
    LTDC_Handler.Init.Backcolor.Red  =0;           //屏幕背景层红色部分
    LTDC_Handler.Init.Backcolor.Green=0;         //屏幕背景层绿色部分
    LTDC_Handler.Init.Backcolor.Blue =0;          //屏幕背景色蓝色部分
    LTDC_Handler.State = HAL_LTDC_STATE_RESET;
    __HAL_RCC_LTDC_CLK_ENABLE();     //使能LTDC时钟
    HAL_LTDC_Init(&LTDC_Handler);

    //层配置
    LTDC_Layer_Parameter_Config(0,(u32)pFrameBufferFG,lcd.LtdcPixelFormat,255,0,6,7,0X000000);//层参数配置
    LTDC_Layer_Window_Config(0,0,0,lcd_display.width,lcd_display.height);
    LTDC_Select_Layer(0);           //选择第1层
    Lcd_BackLight_OnOff(1);

}
//------------------------------------------------------------------
//功能: 背光开关
//参数: true/false
//返回:
//-----------------------------------------------------------------------------


//----控制显示器---------------------------------------------------------------
//功能: 这是由driver提供商编写的，用于设置显示器各种参数的函数，属于应用程序的
//      范畴，功能由设备厂商定义。
//参数: disp，显示器指针
//返回: true=成功，false=失败
//-----------------------------------------------------------------------------
static bool_t __lcd_disp_ctrl(struct DisplayRsc *disp)
{
    return true;
}


//----位图中画像素-------------------------------------------------------------
//功能: 在位图中画一个像素，只有在bitmap的像素格式为cn_custom_pf时，才需要绘制。
//      如果显卡不打算支持自定义格式，本函数直接返回。
//参数: bitmap，目标位图
//      limit，限制矩形，只绘制在该矩形内部的部分
//      x、y，坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: 无
//-----------------------------------------------------------------------------
static bool_t __lcd_set_pixel_bm(struct RectBitmap *bitmap,
                     s32 x,s32 y,u32 color,u32 r2_code)
{
    return false;
}
//----位图中画线---------------------------------------------------------------
//功能: 在位图中画一条直线，不绘制(x2,y2)点，只绘制在limit限定的区域内的部分。
//参数: bitmap，目标位图
//      limit，限制矩形，只绘制在该矩形内部的部分
//      x1、y1、x2、y2，起点终点坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=失败，无硬件加速或不支持按r2_code画线
//-----------------------------------------------------------------------------
static bool_t __lcd_line_bm(struct RectBitmap *bitmap,struct Rectangle *limit,
                        s32 x1,s32 y1,s32 x2,s32 y2,u32 color,u32 r2_code)
{
    return false;
}
//----位图中画线(含端点)-------------------------------------------------------
//功能: 在位图中画一条直线，只绘制在limit限定的区域内的部分。
//参数: bitmap，目标位图
//      limit，限制矩形，只绘制在该矩形内部的部分
//      x1、y1、x2、y2，起点终点坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=失败，无硬件加速或不支持按r2_code画线
//-----------------------------------------------------------------------------
static bool_t __lcd_line_bm_ie(struct RectBitmap *bitmap,struct Rectangle *limit,
                        s32 x1,s32 y1,s32 x2,s32 y2,u32 color,u32 r2_code)
{
    return false;
}
//----位图中填充矩形----------------------------------------------------------------
//Bitmap中矩形填充,支持渐变色
//什么情况下应该实现本函数的功能,参见本结构前面的注释
//镜像显示器无须实现本函数,直接返回false即可
//参数:
// DstBitmap: 绘制的目标位图
// Target: 目标填充区域,渐变色填充时用它的坐标做计算颜色的起点和终点
// Focus: 实际填充区域,gkernel确保其在Target矩形内部
// Color0,Color1: Target左上角和右下角颜色值,如果不是渐变填充,Color1将被忽略,
//              像素格式是CN_SYS_PF_ERGB8888
//Mode: 填充模式,CN_FILLRECT_MODE_N族常数
//返回: true=成功绘制，false=失败
//-----------------------------------------------------------------------------
bool_t __lcd_fill_rect_bm(struct RectBitmap *dst_bitmap,
                          struct Rectangle *Target,
                          struct Rectangle *Focus,
                          u32 Color0,u32 Color1,u32 Mode)
{
    u16 pixel;
    u16 *dst;
    s32 height,width;
    u32 timeout;
    bool_t flag;

    if((Mode != CN_FILLRECT_MODE_N)  \
        ||(dst_bitmap->PixelFormat != lcd.LcdPixelFormat))
      return false;

    pixel = GK_ConvertRGB24ToPF(lcd.LcdPixelFormat,Color0);

    dst = (u16*)((u32)dst_bitmap->bm_bits+Focus->left*lcd.pixsize+\
                     Focus->top * dst_bitmap->linebytes);

    width=Focus->right - Focus->left;
    height=Focus->bottom - Focus->top;
    if(false==Lock_MutexPend(&Dma2dMutex,lcd.Dma2dTimeOut))
      return false;
    DMA2D->CR&=~(1<<0);             //先停止DMA2D
    DMA2D->CR=3<<16;                //寄存器到存储器模式
    DMA2D->OPFCCR=lcd.Dma2dPixelFormat;  //设置输出颜色格式
    DMA2D->OOR  = dst_bitmap->width-width;  //设置行偏移
    DMA2D->OMAR=(u32)dst;               //输出存储器地址
    DMA2D->NLR  = height|(width<<16);   //设定行数寄存器
    DMA2D->OCOLR=pixel;                //设定输出颜色寄存器
    DMA2D->CR|=1<<0;                //启动DMA2D
    timeout =0;
    while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
    {
      timeout+=10;
      Djy_DelayUs(10);
      if(timeout>lcd.Dma2dTimeOut)
      {
          flag=false;
           break;  //超时退出
      }
    }
    DMA2D->IFCR|=1<<1;              //清除传输完成标志
    Lock_MutexPost(&Dma2dMutex);
    return flag;
}
//--------------bitmap中位块传送-----------------------------------------------
//在两个矩形位图中位块传送,如果矩形尺寸不相等,则要实现拉伸或压缩
//什么情况下应该实现本函数的功能,参见本结构前面的注释
//镜像显示器无须实现本函数,直接返回false即可
//参数:
// dst_bitmap: 目标位图
// DstRect: 目标矩形
// src_bitmap: 源位图
// SrcRect: 源矩形
// RopCode: 显示效果,参见 gkernel.h文件中 CN_ROP_ALPHA_SRC_MSK 族常量的说明
// HyalineColor: 透明色,如果参数RopCode中设定了 CN_ROP_KEYCOLOR_EN,则
//                  本参数指定透明色,CN_SYS_PF_ERGB8888格式
//返回: true=成功,false=失败
//-----------------------------------------------------------------------------

